MateuszH96/embedded_ANS/PSA_Lab03/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORSPINS_A2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORSPINS_A2_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORSPINS_A2_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMOTORSPINS_A2_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORSPINS_A2_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_21 (number 30), P17[3]/P24[6]/FC4_I2C_SDA_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORSPINS_B1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORSPINS_B1_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORSPINS_B1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMOTORSPINS_B1_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORSPINS_B1_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_7 (number 6), U20[4]/SD0_CLK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORSPINS_B2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORSPINS_B2_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORSPINS_B2_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMOTORSPINS_B2_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORSPINS_B2_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_6 (number 5), R80/P18[9]/LEDB/PWM_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORSPINS_A1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORSPINS_A1_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORSPINS_A1_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMOTORSPINS_A1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORSPINS_A1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMotorsPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
